# -------------------------------------------------- #
# 集合型（set)
# -------------------------------------------------- #
a = {1, 2, 2, 3, 4, 4, 4, 5, 6}

# 集合型を使うとユニークな値のみ取得出来る
print(a)
print(type(a))

b = {2, 3, 3, 6, 7}
print(b)

print('a :', a)
print('b :', b)

# 論理差（Aのみに含まれる）
print(a - b)

# 論理差（Bのみに含まれる）
print(b - a)

# 論理積（AとBで共通）
print(a & b)

# 論理和（AにもBにも含まれる）
print(a | b)

# 排他 (AまたはBのみに含まれる)
print(a ^ b)

# 部分集合（左辺の要素全てが右辺の集合に含まれるかどうか）
print(a <= b)

# -------------------------------------------------- #
# 集合のメソッド
# -------------------------------------------------- #
s = {1, 2, 3, 4, 5}
print(s)

s.add(6)
print(s)

s.remove(6)
print(s)

s.clear()
print(s)

# これだと辞書型の宣言になる
a = {}
print(type(a))

# 辞書型の宣言
a = set()
print(type(a))
